---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementIsElementTypeFilter
source: html/d2cb666a-0564-89bb-18a8-215c88bb51eb.htm
---
# ElementIsElementTypeFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.